#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/NoxianNet/terraform/runs/run-BBj3wJwjbKvzDPAL

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
linode_domain.signalproxy_master: Refreshing state... [id=1891604]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_instance.reverse_proxy_docker will be created
  + resource "linode_instance" "reverse_proxy_docker" {
      + authorized_keys    = [
          + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMetXNx8lLrcCzlY03GLpyhdhgP1mdR9FitZdB0sYYVM",
        ]
      + backups            = (known after apply)
      + backups_enabled    = (known after apply)
      + boot_config_label  = (known after apply)
      + booted             = (known after apply)
      + id                 = (known after apply)
      + image              = "linode/ubuntu22.04"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "nginx-docker"
      + private_ip_address = (known after apply)
      + region             = "us-east"
      + resize_disk        = false
      + shared_ipv4        = (known after apply)
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "docker",
          + "nginx",
          + "reverse-proxy",
        ]
      + type               = "g6-standard-2"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @TheNite, Action: `pull_request`*